# PRACTICE for 4.2, 5.2, 7.2, 8.2, 9.2

Practice 4.2:

In [6]:
  x = range(2, 11)
for num in x: 
    print (num)

2
3
4
5
6
7
8
9
10

In [20]:
age = int(input("Type in the year you were born: "))
x = str(2021- age)
print(x + '...is how old you will be this year!')

Type in the year you were born: 2001
20...is how old you will be this year!

Practice 5.2:

In [22]:
import numpy as np

In [25]:
x = np.array([[4, 59,85,44,10,1], [10,12,4,6,10,10]])
x
x.shape
len(x)

2

In [26]:
areas = [11.25, 18.0, 20.0, 10.75, 9.50]
for a in areas:
    print(a)

11.25
18.0
20.0
10.75
9.5

In [32]:
for index, area in enumerate(areas) :
    print("Room " + str(index +1) + ": " + str(area) + "ft wide")

Room 1: 11.25ft wide
Room 2: 18.0ft wide
Room 3: 20.0ft wide
Room 4: 10.75ft wide
Room 5: 9.5ft wide

Practice 7.2:

In [35]:
a = np.array([[6,4],[2,1]])
b = np.tile(a, 3)
c = np.tile(b, [2,2])
c

array([[6, 4, 6, 4, 6, 4, 6, 4, 6, 4, 6, 4],
       [2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1],
       [6, 4, 6, 4, 6, 4, 6, 4, 6, 4, 6, 4],
       [2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1]])

In [37]:
import matplotlib.pyplot as plt

In [27]:
offset = 5

while offset != 0 :
    print("correcting...")
    if offset < 0 :
        print(offset)
        offset = offset + 1
    if offset > 0 :
        print(offset)
        offset = offset - 1
    if offset == 0 :  
        print("Awesome!")

correcting...
5
correcting...
4
correcting...
3
correcting...
2
correcting...
1
Awesome!

Practice 8.2:

In [32]:
import pandas as pd

In [43]:
homies = pd.read_excel("test.xlsx", index_col = 0)

In [44]:
homies

          Age  Weight
Name
Jake       37     178
Sam        50     235
Jacob      34     379
Nicholas   32     200
Juan       23     165
Albert     43     149
Rowan      26     157
Darek      21     180
Tree       12     190
Robot      23    2000

In [46]:
print(homies['Age'].median())

29.0

In [47]:
print(homies['Weight'].median())

185.0

Practice 9.2:

In [49]:
print(homies.columns)

Index(['Age', 'Weight'], dtype='object')

In [50]:
print(homies.index)

Index(['Jake', 'Sam', 'Jacob', 'Nicholas', 'Juan', 'Albert', 'Rowan', 'Darek',
       'Tree', 'Robot'],
      dtype='object', name='Name')

In [51]:
print(homies.values)

[[  37  178]
 [  50  235]
 [  34  379]
 [  32  200]
 [  23  165]
 [  43  149]
 [  26  157]
 [  21  180]
 [  12  190]
 [  23 2000]]

In [58]:
homies = homies[(homies['Age']> 21) | (homies['Weight'] > 150)]

In [59]:
homies

          Age  Weight
Name
Jake       37     178
Sam        50     235
Jacob      34     379
Nicholas   32     200
Juan       23     165
Albert     43     149
Rowan      26     157
Darek      21     180
Tree       12     190
Robot      23    2000

Above are all individuals in the party eligable to drink!